========================
$CASE with $PIECE and $ZE
========================

$CASE($P($ZE,">",1)_">", "<INTERRUPT>":"KeyboardInterrupt",
		                                    "<SYNTAX>":"TypeError",
		                                              :"RuntimeError")

---

(source_file
  (expression
    (expr_atom
      (system_defined_function
        (expression
          (expr_atom
            (system_defined_function
              (expression
                (expr_atom
                  (system_defined_variable)))
              (expression
                (expr_atom
                  (string_literal)))
              (expression
                (expr_atom
                  (numeric_literal
                    (integer_literal))))))
          (expr_tail
            (binary_operator)
            (expression
              (expr_atom
                (string_literal)))))
        (dollar_arg_pair
          (expression
            (expr_atom
              (string_literal)))
          (expression
            (expr_atom
              (string_literal))))
        (dollar_arg_pair
          (expression
            (expr_atom
              (string_literal)))
          (expression
            (expr_atom
              (string_literal))))
        (expression
          (expr_atom
            (string_literal)))))))

==============
$PIECE with *-1
==============

$PIECE("SOME STRING", 1, *-1)

---

(source_file
  (expression
    (expr_atom
      (system_defined_function
        (expression
          (expr_atom
            (string_literal)))
        (expression
          (expr_atom
            (numeric_literal
              (integer_literal))))
        (expression
          (expr_atom
            (numeric_literal
              (integer_literal))))))))

===========
$ZF function
===========

$ZF(-1, "/usr/sbin/systemd")

---

(source_file
  (expression
    (expr_atom
      (system_defined_function
        (expression
          (expr_atom
            (unary_expression
              (expression
                (expr_atom
                  (numeric_literal
                    (integer_literal)))))))
        (expression
          (expr_atom
            (string_literal)))))))

====================
$E with *+41 position
====================

$E("Some complicatino string expr $$$"_$$$FOO, 23, *+41)

---

(source_file
  (expression
    (expr_atom
      (system_defined_function
        (expression
          (expr_atom
            (string_literal))
          (expr_tail
            (binary_operator)
            (expression
              (expr_atom
                (macro
                  (macro_constant))))))
        (expression
          (expr_atom
            (numeric_literal
              (integer_literal))))
        (expression
          (expr_atom
            (numeric_literal
              (integer_literal))))))))

==========================
$EXTRACT with *+41 position
==========================

$EXTRACT("Some complicatino string expr $$$"_$$$FOO, 23, *+41)

---

(source_file
  (expression
    (expr_atom
      (system_defined_function
        (expression
          (expr_atom
            (string_literal))
          (expr_tail
            (binary_operator)
            (expression
              (expr_atom
                (macro
                  (macro_constant))))))
        (expression
          (expr_atom
            (numeric_literal
              (integer_literal))))
        (expression
          (expr_atom
            (numeric_literal
              (integer_literal))))))))

=========================
$EXTRACT with *-0 position
=========================

$EXTRACT(mystr,*-0)

---

(source_file
  (expression
    (expr_atom
      (system_defined_function
        (expression
          (expr_atom
            (lvn)))
        (expression
          (expr_atom
            (numeric_literal
              (integer_literal))))))))
